floating/nurion/foamMooring/tutorial/sixDoF_2D/deformMesh/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    stationaryWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          746;
        startFace       128459;
    }
    inlet
    {
        type            patch;
        nFaces          87;
        startFace       129205;
    }
    outlet
    {
        type            patch;
        nFaces          87;
        startFace       129292;
    }
    atmosphere
    {
        type            patch;
        nFaces          746;
        startFace       129379;
    }
    sides
    {
        type            empty;
        inGroups        1(empty);
        nFaces          129324;
        startFace       130125;
    }
    floatingObject
    {
        type            wall;
        inGroups        1(wall);
        nFaces          64;
        startFace       259449;
    }
)

// ************************************************************************* //
